# Coursera Week 2 Course 1 (basic data processing with pandas)

## The Series data structure

In [1]:
import pandas as pd
import numpy as np

### Series Data Structure
1. So,series data structure is kind of dictionary but has data index column of its own.   
2. Series Data structure can also take take index values.  
3. For index vales who's data is not given series provides None or Nan value to it).
4. It is helpful when we have to merge different or multiple data columns.
5. It is 1D data Structure
6. It allows different data types for index and value pair in the same series

We should use functional programming better be known as vectorization to increse the efficiency of the code.  
Vectorization means that to use functions inbuilt rather than conventional programming

In [2]:
animals = ['Tiger','Lion','Mouse']
pd.Series(animals)
# here we can see that pandas as automatically identified the data type of the elements passed
# and also the indexing is done by the Series class

0    Tiger
1     Lion
2    Mouse
dtype: object

In [3]:
numbers= [1,2,3]
pd.Series(numbers)
# this helps to increase the speed over tradiotional python list

0    1
1    2
2    3
dtype: int64

In [4]:
animal1 =['Tiger','Lion',None]
pd.Series(animal1)
# here the None type is automatically converted to object type depending upon the rest data types given

0    Tiger
1     Lion
2     None
dtype: object

In [5]:
num1 =[1,2,3,None]
pd.Series(num1)
# here the Nan number is for Not a Number

0    1.0
1    2.0
2    3.0
3    NaN
dtype: float64

In [6]:
# nan is not null 
np.nan == None

False

In [7]:
np.nan == np.nan

False

In [8]:
# so here we can see that nan is not None type and also its not equal to nan type therefore we need to verify the nan by isNan
np.isnan(np.nan)
# therefore we can see that they are different values for efficiency resons

True

In [9]:
sports = { 'Archery':'Bhutan',
         'Golf':'Scotland',
         'Sumo':'Japan',
         'Taekwondo':'Korea'}
s =pd.Series(sports)

In [10]:
s.index

Index(['Archery', 'Golf', 'Sumo', 'Taekwondo'], dtype='object')

In [11]:
s.values

array(['Bhutan', 'Scotland', 'Japan', 'Korea'], dtype=object)

In [12]:
# we can also do this as
s =pd.Series(['Tiger','Bear','Mouse'], index=['India','America','Canada'])
s
# this is done to create the index by passing it as list explicitly to the series
# also it adds none type to the seris for the index for which we have not provided the any values

India      Tiger
America     Bear
Canada     Mouse
dtype: object

## Quering a Series

In [13]:
sports = { 'Archery':'Bhutan',
         'Golf':'Scotland',
         'Sumo':'Japan',
         'Taekwondo':'Korea'}
s =pd.Series(sports)
s

Archery        Bhutan
Golf         Scotland
Sumo            Japan
Taekwondo       Korea
dtype: object

In [14]:
s.iloc[3] # get rows and column at particular postion at the index so it takes only interger

'Korea'

In [15]:
s.loc['Golf'] # get rows and columns with paticular lables from the index

'Scotland'

In [16]:
s[3]

'Korea'

In [17]:
s['Golf']

'Scotland'

1. Hence we can see that python is smart enough to check weather we have asked for iloc or loc
2. if we have list of numbers we have to explicitly use iloc and loc

In [18]:
animal = {99:'Tiger',
         100:'Fish',
         101:'Lion'}
s=pd.Series(animal)
s

99     Tiger
100     Fish
101     Lion
dtype: object

In [19]:
s[0] # here we get error bcoz there is no key value as 0 therefore we have to explicitly use iloc and loc

KeyError: 0

In [ ]:
s=pd.Series(np.random.randint(0,1000,10000))
s.head()

In [ ]:
len(s)

.loc not only allows to access the data but also modidy it

In [ ]:
s.head()

In [ ]:
# we use magic functions with %centage sign , to know other magic functions just tap tab key after % sign
# to use cellular magic functions we need 2 %% sign
%%timeit -n 100 
# this tells that we want our function to run 100 times and return time to execute it
summary =0
for i in s:
    summary += i

In [ ]:
%%timeit -n 100
summary=np.sum(s)

therefore we see that the vectorization is fast as compared to normal for loop programming

In [ ]:
s=pd.Series([1,2,3,4])
s.loc['Animal']='Tiger'
s
# Hence we can see that series can have different types of data type as index values

In [ ]:
original_sports = pd.Series({'Archery':'Bhutan',
                            'Sumo':'Japan',
                            'Golf':'Scotland'})
cricket_loving_countries = pd.Series(['Australia','England','India','Pakistan'],index=['Cricket','Cricket','Cricket','Cricket'])
cricket_loving_countries

In [ ]:
original_sports

In [ ]:
all_sport = original_sports.append(cricket_loving_countries)
original_sports

In [ ]:
all_sport

### Therefore we see that the append method here dont change the original series in pandas but creates a new series. Hence we must be careful when we use functions in pandas as they may have different meaning here

# Data Frame Data Structure

1. Data Frame is a very useful data structure in python pandas.
2. Data Frames are 2D data structures with column and rows and each column with a name or label
3. Data Frame can be seen as tables in pandas 
4. Data Frame is like a two axis labled array
5. For instance we can use group of series where each series represents a row of data
6. Or a group of dictionaries where each dictionary is row of data

In [46]:
purchase_1 = pd.Series({'Name':'Vinod',
                       'Item Purchased':'Bird food',
                       'Cost':250})
purchase_2=pd.Series( {'Name':'Rishi',
                      'Item Purchased':'Dog Food',
                      'Cost':450})
purchase_3  =pd.Series({'Name':'Abhishek',
                       'Item Purchased':'Fish Food',
                       'Cost':350})
print(purchase_1)
print()
print(purchase_2)
print()
print(purchase_3)

Name                  Vinod
Item Purchased    Bird food
Cost                    250
dtype: object

Name                 Rishi
Item Purchased    Dog Food
Cost                   450
dtype: object

Name               Abhishek
Item Purchased    Fish Food
Cost                    350
dtype: object

In [47]:
df = pd.DataFrame([purchase_1,purchase_2,purchase_3],index=['Store 1','Store 1','Store 2'])
df 
# here we have each row as series and the lables in the series are as the column names
# we put different series in data frame to make it as table
# we see that the values which are not present pandas pur NaN for it

             Name Item Purchased  Cost
Store 1     Vinod      Bird food   250
Store 1     Rishi       Dog Food   450
Store 2  Abhishek      Fish Food   350

In [48]:
df.loc['Store 2']

Name               Abhishek
Item Purchased    Fish Food
Cost                    350
Name: Store 2, dtype: object

In [49]:
df.loc['Store 1']

          Name Item Purchased  Cost
Store 1  Vinod      Bird food   250
Store 1  Rishi       Dog Food   450

In [50]:
df['Cost']# to access the values in the Cost column

Store 1    250
Store 1    450
Store 2    350
Name: Cost, dtype: int64

In [51]:
# row selection
print(df.loc['Store 1','Cost'])

# for Column selection
#1. Get the Transpose with help of T attribute and then use the loc method 
print()
print(df.T)
print()
print(df.T.loc['Cost'])  # method 1
print()
# method 2
df['Cost']

Store 1    250
Store 1    450
Name: Cost, dtype: int64

                  Store 1   Store 1    Store 2
Name                Vinod     Rishi   Abhishek
Item Purchased  Bird food  Dog Food  Fish Food
Cost                  250       450        350

Store 1    250
Store 1    450
Store 2    350
Name: Cost, dtype: object

Store 1    250
Store 1    450
Store 2    350
Name: Cost, dtype: int64

In [52]:
df.loc['Store 1']['Cost'] # here we get the values of the Cost for Store 1

Store 1    250
Store 1    450
Name: Cost, dtype: int64

the above is called as chaining database and it returns the copy the original dataset and thus is slow. therefore we must avoid chainig of data set

In [53]:
# .log as supports slicing 

df.loc[:,['Cost','Name']]

         Cost      Name
Store 1   250     Vinod
Store 1   450     Rishi
Store 2   350  Abhishek

**How to drop a label**

In [54]:
df.drop('Store 1')
# here we can see that the rows with Store 1 as the value are gone however the actual datatable is not affected

             Name Item Purchased  Cost
Store 2  Abhishek      Fish Food   350

In [55]:
copy_df =df.copy()
copy_df.drop('Store 2')
# here we can see that the copy the df dataframe is has deleted Store 2 values from its copy but not from the actual copy

          Name Item Purchased  Cost
Store 1  Vinod      Bird food   250
Store 1  Rishi       Dog Food   450

In [56]:
copy_df

             Name Item Purchased  Cost
Store 1     Vinod      Bird food   250
Store 1     Rishi       Dog Food   450
Store 2  Abhishek      Fish Food   350

In [57]:
# adding a new data value in the data frame
del copy_df['Name']
copy_df
#here the original data frame is deleted

        Item Purchased  Cost
Store 1      Bird food   250
Store 1       Dog Food   450
Store 2      Fish Food   350

In [58]:
df['Location']=None # adding a column with default value as None

In [59]:
df

             Name Item Purchased  Cost Location
Store 1     Vinod      Bird food   250     None
Store 1     Rishi       Dog Food   450     None
Store 2  Abhishek      Fish Food   350     None

# DataFrame indexing and loading

In [60]:
Costs= df['Cost']
Costs

Store 1    250
Store 1    450
Store 2    350
Name: Cost, dtype: int64

In [61]:
Costs += 2
Costs

Store 1    252
Store 1    452
Store 2    352
Name: Cost, dtype: int64

In [62]:
df

             Name Item Purchased  Cost Location
Store 1     Vinod      Bird food   252     None
Store 1     Rishi       Dog Food   452     None
Store 2  Abhishek      Fish Food   352     None